<?php
/************* Infos Plugin REQUIS! ***************/
$lang[$plugin.'name']            = 'Darkmode';
$lang[$plugin.'version']         = '1.5.7';
$lang[$plugin.'update']          = '2021-02-28';
$lang[$plugin.'author']          = 'Frédéric K.';
$lang[$plugin.'author_site']     = 'https://flatboard.org';
$lang[$plugin.'author_mail']     = 'stradfred@gmail.com';
/************* Langue fr ***************/
$lang[$plugin.'description']	 = '🌓 Добавьте тёмный режим / ночной режим на свой сайт за несколько секунд.';

$lang['saveInCookies'] 	 = 'Сохранять выбор пользователей';
$lang['Cookies_Desc'] 	 = 'Сохранять выбор пользователей в cookies-файлах';
$lang['autoMatchOsTheme']= 'Персонализированные темы ' .Util::Help('Если браузеры поддерживают предпочитаемую цветовую схему.');
$lang['autoOsTheme_Desc']= 'Автоматически показывает Тёмный режим, если предпочитаемая тема в ОС пользователя тёмная.';
$lang['right']  	   	 = 'Правильное отображение?';
$lang['rightDesc']  	 = 'Если отображение справа отключено, оно будет размещено слева.';
  
$lang['bottom']  	   	 = 'Нижний отступ <em>(в пикселях)</em>'; 
$lang['rightORleft']  	 = 'Левый или правый отступ <em>(в пикселях)</em>'; 
$lang['time']  	   	 	 = 'Время анимации <em>(в секундах)</em>'; 
$lang['buttonLabel']  	 = 'Иконка кнопки ' .Util::Help('🌖 🌓 🌟 🚀 ✨');
 
$lang['mixColor']  	   	 = 'Настроить цвета'; 
$lang['backgroundColor'] = 'Цвет фона';  
$lang['buttonColorDark'] = 'Цвет кнопки в Тёмном режиме';
$lang['buttonColorLight']= 'Цвет кнопки в Светлом режиме';
?>